# Taps
tap "derailed/k9s"

# Common CLI
brew "bat"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "k6"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "zoxide"

# Mac-specific formulae
brew "bottom"
brew "ccusage"
brew "cocoapods"
brew "fnm"
brew "gemini-cli"
brew "gh"
brew "derailed/k9s/k9s"
brew "kustomize"
brew "mas"
brew "neofetch"
brew "openjdk"
brew "pipx"
brew "pyenv"
brew "python-setuptools"
brew "python@3.11"
brew "wget"
brew "ykman"

# Casks
cask "1password"
cask "1password-cli"
cask "alfred"
cask "android-commandlinetools"
cask "appcleaner"
cask "arc"
cask "bartender"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "coteditor"
cask "cursor"
cask "daisydisk"
cask "discord"
cask "docker"
cask "figma"
cask "font-hasklig"
cask "font-sauce-code-pro-nerd-font"
cask "font-terminus"
cask "freedom"
cask "ghostty"
cask "gitkraken"
cask "google-chrome"
cask "google-drive"
cask "handbrake"
cask "hush"
cask "ivpn"
cask "jetbrains-toolbox"
cask "keka"
cask "knockknock"
cask "little-snitch"
cask "lm-studio"
cask "lunar"
cask "maccy"
cask "mem"
cask "micro-snitch"
cask "mongodb-compass"
cask "mos"
cask "rectangle-pro"
cask "slack"
cask "soulver"
cask "ssh-config-editor"
cask "syncthing"
cask "tailscale"
cask "tg-pro"
cask "trezor-suite"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Dropover", id: 1355679052
mas "GoodLinks", id: 1474335294
mas "Reeder", id: 1529448980
mas "Velja", id: 1491071483
mas "Wipr", id: 1320666476
